"use client";
import PageHeader from "@/components/SmallComponents/PageHeader";
import { Stack, Typography } from "@mui/material";
import Image from "next/image";

const page = () => {
  return (
    <Stack>
      <PageHeader
        title="Планински туризъм"
        image="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%AF%D0%B2%D0%BE%D1%80%D0%BD%D0%B8%D1%88%D0%BA%D0%B8%20%D0%B2%D0%BE%D0%B4%D0%BE%D0%BF%D0%B0%D0%B4_vVAZxnJWq.jpg?updatedAt=1709650019042"
      />

      <Stack width="100%" maxWidth="1600px" m="0 auto" gap={8} py={10} px={4}>
        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%9A%D0%BB%D1%8E%D1%87%D0%BA%D0%B8_4XRrMiesV.png?updatedAt=1709650325507"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "700px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Ключки водопад
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Пътеката до водопадите води своето начало от центъра на село Ключ,
              което е на около 20 км. от гр. Петрич. До водопадите се стига по
              добре поддържан туристически маршрут, като се следва зелената
              маркировка. Продължителността на маршрута е 1 час и 10 минути, а
              дължината му е 2,2 км. По него има разположено информационно табло
              за много рядко растение Царски папрат-Osmunda regalis, което се
              среща само в полето на село Коларово и в планината над село Ключ.
              А до таблото има и чешмичка с чиста питейна вода. Водопадите са
              три на брой, разположени един над друг. Първи е Чергата,
              непосредствено над него е Метлата и на пет минути над тях е
              Вретеното. Маршрутът започва от центъра на селото първоначално по
              широк горски път, който постепенно се стеснява докато накрая се
              превърне в тясна пътечка. През цялото време до водопадите се върви
              по дере с вековни дървета. Преди да достигнете до първия водопад
              ще преминете през дървено мостче. Малка по- нагоре има дървени
              стълбички и преди третия водопад пак се преминава през още едно
              дървено мостче. С цел безопасност на туриста на по-стръмните
              участъци има поставени и помощни въжета. По целия маршрут ще
              срещате и дървени насочващи табели.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%AF%D0%B2%D0%BE%D1%80%D0%BD%D0%B8%D1%88%D0%BA%D0%B8%20%D0%B2%D0%BE%D0%B4%D0%BE%D0%BF%D0%B0%D0%B4_vVAZxnJWq.jpg?updatedAt=1709650019042"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Яворнишки водопад
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Пътеката до водопада води своето начало от центъра на село
              Яворница, което е на двадесетина километра от гр. Петрич. До
              водопада се стига по добре поддържан тематичен маршрут „Пеперудите
              и цветята на Беласица”, а маркировката е синя. По него са
              разположени четири тематични информационни табла — „Жизненият
              цикъл при пеперудите“, „Пеперудите и цветята на Беласица по
              откритите места“, „Пеперудите и цветята на Беласица в
              храсталаците“, „Пеперудите и цветята на Беласица в гората“.
              Продължителността на маршрута е 1 час и 20 минути, а дължината му
              е 2,8 км. Маршрутът започва от центъра на селото, преминава през
              джамията /жълта постройка, без минаре/ и продължава по черен път.
              Пътят постепенно се стеснява докато накрая се превърне в тясна
              пътечка. През цялото време до водопада се върви по дерето на река
              Яворнишка. Пътеката е много живописна и подходяща за разходки с
              деца, както и за пикник. Дава възможност за запознаване с някои
              дневни пеперуди и цветни растения, за узнаване на любопитни факти
              за тях и защо не могат едни без други.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%9A%D0%B0%D0%BC%D0%B5%D1%88%D0%BD%D0%B8%D1%88%D0%BA%D0%B8_uXSk9DZLV.jpg?updatedAt=1709650324497"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Каменишки водопад
            </Typography>
            <Typography component="p" variant="body1" textAlign="justify">
              Пътеката до водопада води своето начало от с. Камена на около
              петнадесетина километра от гр. Петрич. Тръгва се от покрайнините
              на селото, с плавно изкачване по десния бряг на р. Камешница,
              следвайки зелена маркировка. По серпентини пътеката набира
              височина и след 10 минутно ходене се преминава на левия бряг на
              реката по дървено мостче. Малко по- нагоре по друго дървено мостче
              се преминава над реката и пътеката продължава по десния ѝ бряг.
              След около 30- 40 минути ходене се стига до беседка с масичка и
              пейки. От беседката пътеката продължава със стръмно спускане към
              реката. И след още 10 минути се изправяте пред считания за най-
              красив водопад в българската част на Беласица. Височината му е 21
              метра, а пред него над реката е направен дървен мост, за по- добро
              наблюдение. До Камешнишки водопад има разработен и друг маршрут,
              който започва от село Коларово. Този маршрут е наречен „Тайните на
              водата“. Той преминава покрай сградата на ДПП „Беласица” и по
              черен път стига до чакълирания път за с. Самуилово. Минава се през
              м. Бялата чешма свързана с героичните събития от началото на ХХ в.
              и стига до водопада. Продължителността на маршрута е около 3 часа.
              По пътеката има 5 информационни табла, представящи интересна и по
              запомнящ се начин информация за водата около нас, нейната
              незаменима роля, за съществуването на живота на земята и начините,
              по които можем да опазим това неоценимо богатство.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%9B%D0%B5%D1%88%D0%BD%D0%B8%D1%88%D0%BA%D0%B8%20%D0%B2%D0%BE%D0%B4%D0%BE%D0%BF%D0%B0%D0%B4_pYBG-aLVs.jpg?updatedAt=1709650019079"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Лешнишки водопад
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Водопадът се простира на река Лешнишка в Природен парк „Беласица”
              на 680 метра надморска височина. Водите му падат от 6,5 метра
              височина и продължават пътя си по няколко каменни стъпала,
              създавайки невероятна картина. До него води тематичен маршрут
              „Приятели”, който започва от хижа „Беласица”, маркирана със син
              цвят. По него са разположени 4 интерактивни модула, които
              представят любопитна информация за 10 дървета в Беласица,
              различаване на дърветата по тяхната кора, горите и техните
              обитатели и какво дават дърветата. Пътеката преминава през вековна
              букова гора и в по-голямата си част тя е равна. А времето за
              достигане от хижата до водопада е около 40-45 минути. Лешнишки
              водопад си заслужава да бъде видян не само заради красотата на
              разстилащата се водна струя, а и заради чудесното изживяване,
              което предлага приятната пътека, достигаща до тази
              забележителност.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/dybnica_-VrFwNT9o.jpg?updatedAt=1709650324695"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Водопад Дъбница
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Пътеката до водопада води ствоето начало от центъра на село Скрът,
              от където започват три пешеходни маршрута: до водопад Дъбицата –
              зелена маркировка; до водопад Мангъро – синя маркировка; до връх
              Тумба – жълта маркировка; От площада на селото с леко изкачване
              около 1 километър по пътя се стига до църквата „Възвисение
              Господне”. Тук се прави завой в дясно и се продължава по изоставен
              горски път сред вековна Чинарова гора. За около 15 минути от
              църквата се стига до мястото където маркировките се разделят. До
              водопад Дъбицата се поема на дясно , следвайки зелената и жълтата
              маркировка. След около десетина минути ходене двете маркировки се
              разделят. Следвайки зелената маркировка ще ви отведе към една
              стръмна и тясна пътека в гората. След около 20-30 минути ще
              стигнете до още един – финален разклон. Там се поема на дясно,
              където предстои слизане до водопада. От този разклон след не
              повече от 5 минути, в ниската част пред вас ще се разкрие водопад
              Дъбицата с цялата си прелест. Водопадът е висок 10 м. и е наистина
              много красив. Намира се на 1160 м. надморска височина.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%92%D0%BE%D0%B4%D0%BE%D0%BF%D0%B0%D0%B4%20%D0%9C%D0%B0%D0%BD%D0%B3%D1%8A%D1%80%D0%BE_AqrWzrvFA.jpg?updatedAt=1709650018890"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Водопад Мангъро
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Пътеката до водопада води ствоето начало от центъра на село Скрът,
              от където започват три пешеходни маршрута: до водопад Дъбицата –
              зелена маркировка; до водопад Мангъро – синя маркировка; до връх
              Тумба – жълта маркировка; От площада на селото с леко изкачване
              около 1 километър по пътя се стига до църквата „Възвисение
              Господне”. Тук се прави завой в дясно и се продължава по изоставен
              горски път сред вековна Чинарова гора. За около 15 минути от
              църквата се стига до мястото където маркировките се разделят. До
              водопад Дъбицата се поема на дясно , следвайки зелената и жълтата
              маркировка. След около десетина минути ходене двете маркировки се
              разделят. Следвайки зелената маркировка ще ви отведе към една
              стръмна и тясна пътека в гората. След около 20-30 минути ще
              стигнете до още един – финален разклон. Там се поема на дясно,
              където предстои слизане до водопада. От този разклон след не
              повече от 5 минути, в ниската част пред вас ще се разкрие водопад
            </Typography>
          </Stack>
        </Stack>
      </Stack>
    </Stack>
  );
};

export default page;
