"use client";
import PageHeader from "@/components/SmallComponents/PageHeader";
import { Stack, Typography } from "@mui/material";
import Image from "next/image";

const page = () => {
  return (
    <Stack>
      <PageHeader
        title="Селски туризъм"
        image="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%91%D0%BE%D1%80%D0%BE%D0%B2%D0%B8%D1%87%D0%B5%D0%BD%D0%B5_TjXD1j7ap.jpeg?updatedAt=1709651218436"
      />

      <Stack width="100%" maxWidth="1600px" m="0 auto" gap={8} py={10} px={4}>
        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%B4%D0%BE%D0%BB%D0%B5%D0%BD%D0%B5_0eLKnwMBk.jpg?updatedAt=1709651755227"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Село Долене
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Приказка за най- красивото село в света! Тази приказка не започва
              с “Имало едно време....” Нея и има и сега ... Там камъкът и
              цветята говорят в един глас! Там дори планината с нейната мощ и
              скалите с тяхната студенина ви сгряват, цветята ви обгръщат и вече
              сте в рая, вие сте част от приказката! Виждате я, усещате аромата
              й, можете да я почувствате! Приказката за този рай я има, защото
              отдавна преди това историята я предначертава! Потапяте се по-
              дълбоко в нея и откривате нейният истински смисъл. Пред вас се
              разкрива многовековна история с всичките й най-пазени тайни,
              усещате мистиката, обгръща ви една по различна енергия! Отварят се
              врати към отдавна забравени изкуства, като знахарството и
              каменарството! Същевременно ще откриете и нови направления , като
              флористиката, но в един различен стил съчетаващ изящно- минало,
              настояще и бъдеще! Приказката продължава! За да бъдете част от нея
              ще ви е необходимо единствено да заявите деня на своето посещение
              чрез изброените начини за контакти.
            </Typography>
            <Typography component="p" variant="body1" textAlign="justify">
              Тел: 0878694905 Имейл: info@selodolene.com Фейсбук страница:
              Долене Инстаграм: selodolene Уеб страница www.selodolene.com
            </Typography>
            <Typography component="p" variant="body1" textAlign="justify">
              Можете да я откриете на 20км. от Петрич, посока Северна Македония,
              като при отбивката от главният път за селото се преминава през 2
              км черен път, който се поддържа проходим за всякакъв вид
              автомобили.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%91%D0%BE%D1%80%D0%BE%D0%B2%D0%B8%D1%87%D0%B5%D0%BD%D0%B5_TjXD1j7ap.jpeg?updatedAt=1709651218436"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Село Боровичене
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Боровичене е българско село, което се намира в югоизточната част
              на страната, близо до границата с Македония. Разположено е в
              планински район в географската област Пиринска Македония. Селото
              разполага с една къща за гости, предлагаща 25 места. Тя е
              изградена в автентичен селски стил, като в същото време предлага
              всички нужни и съвременни удобства.
            </Typography>
            <Typography component="p" variant="body1" textAlign="justify">
              Може да се разходите в селото, което е изключително тихо и
              спокойно. Може да отидете и до близките гори, където въздухът е
              изключително чисто. Наблизо се намира и река Струмешница, в която
              има прекрасни условия за риболов и излет.
            </Typography>
            <Typography component="p" variant="body1" textAlign="justify">
              Забележителности, които да посетите в местността На 3 км южно се
              намира прочутата Самуилова крепост. Тя е изградена на десния бряг
              на река Струмешница през периода 1009-1013 година, когато
              българският цар Самуил води война с Византийската империя.
              Крепостта е била част от Ключката отбранителна система. В днешно
              време тя е превърната в национален парк-музей, който предлага
              редица интересни занимания и беседи.
            </Typography>
            <Typography component="p" variant="body1" textAlign="justify">
              Наблизо се намира и Чуриловският манастир Свети Георги, разположен
              край едноименното село Чурилово. Изграден е през 1852 година, като
              по-късно е реставриран. Днес е запазен напълно и е отворен за
              посетители.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D1%80%D1%83%D0%BF%D0%B8%D1%82%D0%B5_TRIphrnIC.jpg?updatedAt=1709651755532"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Село Рупите
            </Typography>
            <Typography component="p" variant="body1" textAlign="justify">
              Село Рупите е разположено на 9 км североизточно от Петрич, край р.
              Струмешница в една от най-красивите местности, носеща името на
              селото. Населението е малко над 1100 жители. На 2 км. източно от
              селото в месността Кожух се намират руините от един от
              най-големите антични градове по долината на Струма, съществувал от
              ІV в. пр. Хр. до VІ в. сл. Хр. В досегашната исторически
              изследвания този град се свързваше с античната Петра. Откритият
              тук през 2002 г. латински надпис от 309 г. сл. Хр. по недвусмислен
              начин доказа, че край село Рупите се е намирал античния град
              Хераклея Синтика, споменат многократно от античните автори. Досега
              този град бе локализиран на юг от Беласица.
            </Typography>
            <Typography component="p" variant="body1" textAlign="justify">
              В землището на селото се намира известната месност Рупите, където
              в последните години от живота си живееше Ванга. През 1994 г. е
              построен храма &quot;Св. Петка Българска&quot;, в близост до
              къщичката, в която тя е живяла. Предсмъртното желание на Ванга е
              било тя да бъде погребана в двора на къщичката си, за да може
              хората да черпят сили от гроба ѝ, и въпреки да не е сред нас тя
              пак да може да помага. Но от фондация &quot;Ванга&quot; решиха да
              не уважат това нейно желание и тя бе погребана до храма &quot;Св.
              Петка Българска&quot;. Местността Рупите е разположена в
              подножието на хълма Кожух. Преди стотици години Кожух е била
              вулкан. Чудотворните земи са резултат от изригването на този
              вулкан. Известна е с редки дървесни и животински видове, някои от
              които са включени в Червената книга на страната.Тук се намират
              много целебни минерални извори и църквата &quot;Света Петка&quot;
              на българската пророчица Ванга. Рупите е и орнитологична станция,
              занимаваща се с движението на мигриращите птици. За това късче
              земя прочутата българска пророчица баба Ванга казваше, че е
              наситено с особена енергия.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%A1%D1%82%D0%B0%D1%80%D1%87%D0%B5%D0%B2%D0%BE_9D3qIEpQa.jpeg?updatedAt=1709651218182"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Село Старчево
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Село Старчево се намира в Петричката котловина в югоизточното
              подножие на Огражден планина. Отстои на около 10 километра северно
              от общинския център Петрич,а съседни му села са Кърналово и
              Рибник.
            </Typography>
            <Typography component="p" variant="body1" textAlign="justify">
              В околностите на Старчево са открити следи от неолитни поселения,
              тракийски могили , славянски селища и т.н. Селото се споменава в
              османски регистри от XVI–XVII век под името Истарчева.
            </Typography>
            <Typography component="p" variant="body1" textAlign="justify">
              Православен храм &quot;Св. Влкмч Мина&quot; с. Старчево e pостроен
              през 1848г. Храмът е първата възрожденска църква в Петричко.
              Известен е с лековита си сила. Всяка година на 11 ноември (деня на
              светите мъченици Мина, Виктор и Викентий) храмът отбелязва своя
              празник с празнична литургия. В селото се организира голям събор,
              на който присъстват вярващи от различни краища на България и
              Гърция. Много от тях остават да пренощуват в храма. Поверието
              гласи, че ако боледуващ преспи в черквата вечерта на 10 срещу 11
              ноември, то той ще бъде излекуван. Тъй като Св. Мина е закрилник
              на семейството, много бездетни семейства идват в храма да се
              помолят за деца. Традиционно се извършват и много венчавки. Самата
              църква е изключително красива, изографисана с разнообразни икони.
              Една от най-богатите и добре поддържани църкви в община Петрич.
              Село Старчево е разположено между градовете Сандански (12км.) и
              Петрич(10км.), в близост до местността &quot; Рупите&quot;,
              възвишението Кожух и мистичният град Хераклея Синтика.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%9C%D0%B0%D1%80%D0%B8%D0%BA%D0%BE%D1%81%D1%82%D0%B8%D0%BD%D0%BE%D0%B2%D0%BE_AmpmMFxqc.jpg?updatedAt=1709651755883"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Село Марикостиново
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Село Марикостиново е разположено в Петричко-Санданската котловина
              на левия бряг на река Струма.
            </Typography>
            <Typography component="p" variant="body1" textAlign="justify">
              Според стара легенда девойка на име Мария от този край е
              преследвана от турците. Тя е заловена от поробителите в района на
              днешното село Марино поле и е убита. Дивите животни разнесли
              костите ѝ. Там, където те са открити от нейните близки, възникнало
              село Марикостиново.
            </Typography>
            <Typography component="p" variant="body1" textAlign="justify">
              Село Марикостиново е селище с богато историческо минало. В
              землището на селото са открити археологически останки от времето
              на античността и средновековието. В местността Марена (на около 3
              километра северозападно от селото) са запазени останки от антична
              крепост.
            </Typography>
            <Typography component="p" variant="body1" textAlign="justify">
              Много богата е историята на местното училище. То е създадено през
              1898г. и първоначално се е помещавало в пристройка към черквата.
              Сградата на местното основно училище е построена през 1936г. с
              доброволен труд на населението от селото.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%9A%D1%80%D0%BE%D0%BC%D0%B8%D0%B4%D0%BE%D0%B2%D0%BE_Tdf1eweTA.jpg?updatedAt=1709651755233"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Село Кромидово
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Кромидово е село в Югозападна България, Община Петрич. Намира се
              на 21 км източно от гр. Петрич, на 13 км северно от
              българско-гръцката граница при село Кулата. Намира се на около 5
              км от международния път Е-79 (Видин-София-Кулата-Атина). Има
              редовен автобусен транспорт до съседните населени места.
            </Typography>
            <Typography component="p" variant="body1" textAlign="justify">
              Кромидово се намира в западните части на полите на Пирин планина,
              на 175 м надморска височина, а Мелнишка река тече край селото.
              Климатът се характеризира с горещо, сухо лято и кратка, мека зима.
              Средните януарски температури са около 1 С, а средните юлски около
              37 С. Районът е благоприятен за отглеждането на земеделски
              култури, трайни насаждения, както и за развиването на
              животновъдство. В землището на селото има много лозя и оранжерии.
            </Typography>
            <Typography component="p" variant="body1" textAlign="justify">
              Кромидово е известно със своите три термоминерални находища.
              Минералната вода отговаря на изискванията за курортните ресурси и
              курортни местности. Тук има още обществена хигиенна баня и басейн.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%A1%D0%BA%D1%80%D1%8A%D1%82_CWNVvTRx2.jpeg?updatedAt=1709651218413"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Село Скрът
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Село в Петричка община, разположено на 16 км югозападно от гр.
              Петрич. в подножието на северните склонове на планината Беласица
              на надморска височина 540 м. Запазените малко на брой стари къщи
              типологично са повлияни от огражденско-малешевската къща. Те са
              двукатни, с носещи камени стени в двата етажа. Отвореният към
              двора чардак е изграден с масивна, грубо обработена дървена
              конструкция. Две от къщите са паметници на културата. Основното
              (от 1931 г.) училище &ldquo;Пейо Яворов&ldquo; е открито през 1914
              г. като начално. В училището има танцов хор, певческа група,
              правят се новогодишни програми, представят се обичаи. Към читалище
              „Антон Попов” (основано през 1961 г.) има женска и мъжка певчески
              фолклорни групи, както и детски танцов състав. На сградата на
              кметството е поставена паметна плоча на загиналите от с. Скрът във
              войните 1912 – 1918 г. и в Отечествената война 1944 – 1945 г.. В
              землището на селото се намира Самуиловата крепост. Според местни
              хора по време на турското робство в селото е имало 12 черкви и 1
              джамия. Една от черквите е действаща в момента. В местността
              Кърлиго има останки от малко антично селище. Останки от селища от
              античноста и османския период са открити северно от Скрът – в
              местностите Колибите, Балково и Гърченица. Под името Искрът селото
              се споменава в османските регистри от 1570 г. и 1665 г.. В центъра
              на селото има вековно чинарово дърво на около 500 г. От Скрът
              започват атрактивни туристически маршрути, стигащи до двата
              водопада – Дъбицата и Мангъро. От това село започва маркираният
              основен туристически маршрут до граничния връх Тумба.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%9A%D0%BB%D1%8E%D1%87_kIsNXsNg5S.jpeg?updatedAt=1709651218344"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Село Ключ
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Село притежаващо отличието &quot;Златен печат&quot; за уникално
              европейско селище заради древна история и уникално културно
              наследство, присъдено му от Европейския форум на експертите.
              Такова имат и много европейски градове, сред които Флоренция,
              Драма, Нахар, Страсбург... и село Ключ. Ключ е село в Петричка
              община, намиращо се на 20 км. югозападно от гр. Петрич.
              Разположено е в северните склонове на планината Беласица на
              надморска височина около 500 м. През селото тече Ключка река,
              десен приток на р. Струмешница. През 1958 г. към Ключ е
              присъединена махала Самуилова крепост. Културната дейност се
              развива в читалище „Гоце Делчев”. На възвишението Самуилова
              крепост (на около 5 км. северно от Ключ) е издигнат мемориалният
              комплекс на цар Самуил (997-1014) и войската му. Върху
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%AF%D0%B2%D0%BE%D1%80%D0%BD%D0%B8%D1%86%D0%B0_w8wk3aTFDI.jpeg?updatedAt=1709651218397"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Село Яворница
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Село в Петричка община, на 18 км. западно от гр.Петрич.
              Разположено е в северното подножие на планината Беласица, на
              надморска височина около 500 м. Климатът е
              преходносредиземноморски. През селото тече Яворнишка река. Река
              Струмешница огражда от север землището на селото. Шест къщи в
              селото са паметник на културата. Читалище „Антон Попов” с.
              Яворница е основано през 1965 г.. В читалището има женска група за
              автентичен фолклор, женска група за обработен фолклор, детска
              вокална група, детска група за народни танци, женска група за
              народни танци, ромска танцова група. Чрез своите самодейци
              читалището участва в международни, окръжни и общински фестивали и
              събори. Печелило е златни и сребърни медали от „Пирин пее”,
              „Копривщица”, „Южен гердан”. Има изяви и зад граница в Румъния,
              Гърция, Македония. Под името Яворниче селото е споменато в
              османските регистри от 1570 г. и от 1664 г.. Храмовият празник е
              на 11 май, когато се прави курбан в черквата. На 24 май е събора
              на селото. Чества се и Св.Петка - първа седмица след Великден. За
              по-любознателните туристи - тук се намира тематичния маршрут
              &quot;Пеперудите и цветята на Беласица&quot; - лъчев маршрут от с.
              Яворница до Яворнишкия водопад. Маршрутът дава възможност за
              запознаване с някои дневни пеперуди и цветни растения, за узнаване
              на любопитни факти за тях и защо не могат едни без други. И
              разбира се кулминацията на маршрута, а именно Яворнишкият водопад
              и живописната природна гледка, която се разкрива пред Вас!
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%A1%D0%B0%D0%BC%D1%83%D0%B8%D0%BB%D0%BE%D0%B2%D0%BE_50ukXRrNMT.jpeg?updatedAt=1709651218354"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Село Самуилово
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Самуилово (известно в миналото като село Димидово) се намира в
              подножието на планината Беласица на 13 км. югозападно от гр.
              Петрич. Заедно с още седем села, разположени на 1-2 км. едно от
              друго, образуват наниз от красиви села, наречени Подгорие. Селото
              е разположено на надморска височина около 300 м. Климатът е
              преходно средиземноморски. Северно край землището на селото тече
              р. Струмешница.
            </Typography>
            <Typography component="p" variant="body1" textAlign="justify">
              Читалището в с. Самуилово е основано на 05.06.1926 г. То се е
              помещавало в една стара сграда в близост до турската джамия
              /днешната черква/, която е изпълнявала и ролята на училище до 1938
              г. Тогава е носило името ,,Развитие”. От 1944 г. носи името
              ,,Антон Попов”. Първите наченки на театрална дейност се забелязват
              през 1947 г., когато е сформирана самодейната театрална група, а
              първата постановка на сцена от тях е ,,Доктор по неволя”. През
              есента на 1954 г. е основана женската певческа група, която
              съществува и до днес. През 1995 г. се сформира мъжка певческа
              група. Като новост в дейността на читалището е сформирането на
              смесен хор за обработен и автентичен фолклор, детска група за
              народни танци и група за модерни танци. Всички групи и танцови
              състави активно се включват в провеждането и организирането на
              прояви в културния живот на селото, гостуват и в други населени
              места. В селото се спазват всички народни традиции и се
              пресъздават обичаи като ,,Бабин ден “, „Дрельо”, „Жътва”,
              „Седянка” и много други. Всички групи вземат участие в празниците
              на селото - Деня на самодееца и 8-ми март.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%9A%D0%BE%D0%BB%D0%B0%D1%80%D0%BE%D0%B2%D0%BE_afXEEI3eWp.jpeg?updatedAt=1709651218417"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Село Коларово
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Коларово е село в Петричка община, разположено на 14 км. от
              административния център. До 1966 г. името на селото е било
              Коларево. Селото е разположено в Подгорието на надморска височина
              400 м. През землището му тече Коларовска река, а северно край него
              – р.Струмешница. В с. Коларово има средно общообразователно
              училище „Васил Левски” и детска градина. Културната дейност се
              развива от читалище „Яне Сандански”, основано през 1939 г. Към
              него има женска певческа група, мъжка певческа група „Комитска
              песен” и детски танцов състав. От 2013г, функционира и Дирекцията
              на Природен парк &quot;Беласица&quot; с нейния посетителски център
              намиращ се отново в с. Коларово, в който център посетителите могат
              да научат за природните богатства на парка. Храмовият празник е на
              Димитровден (26 октомври), тогава е и съборът на селото. На втория
              ден от Великден местните хора се събират в м. Чуката. Село
              Коларово предлага и настаняване на своите гости, като предпочитани
              локации на туристите са Хотелски комплекс &quot;Света
              Неделя&quot;, Еко хотел &quot;Момата&quot; и др. Непосредствено
              преди селото се намира и винарна &quot;Орбелия&quot;, в която пък
              може да се насладите на традиционните за местността вина.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%91%D0%B5%D0%BB%D0%B0%D1%81%D0%B8%D1%86%D0%B0_ikFe_RynW.jpeg?updatedAt=1709651218450"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Село Беласица
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Село Беласица се намира на 12 км. югозападно от Петрич. Селото е
              разположено в северното подножие на планината Беласица, на
              надморска височина 385 м., a северно край землището на селото тече
              река Струмешница. Запазени са някои възрожденски сгради, които
              принадлежат към типа на огражденско-малешевската къща, пет от тях
              са паметници на културата. В с. Беласица има читалище „Просвета”
              основано през 1945 г. В землището на селото са запазени останки от
              антични селища – в м. Пандевица (северно от Беласица) и м.
              Платоник (източно край Беласица). През 1897 г. е построена
              църквата „Св. Пророк Илия”, която е и паметник на културата, храм,
              който и до днес привлича безброй вярващи да го посещават. Заради
              името на черквата Илинден е празник на селото.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%9A%D0%B0%D0%BC%D0%B5%D0%BD%D0%B0_dxVm3TPif.jpg?updatedAt=1709651755318"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Село Камена
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Камена е китно малко селце в Петричка община, намиращо се на 16
              км. югозападно от гр. Петрич. Разположено е в северните склонове
              на планина Беласица, на надморска височина от 439 м. От запад, юг
              и изток е заобиколено от ридове, а източно край село Камена тече
              река Камешница, десен приток на р. Струмешница. Според преданието
              името на селото произлиза от факта, че реката, която минава през
              селото влачи много камъни и пясък. Места, на които може да се
              настаните в селото на Бунгала &quot;Камена&quot; или Екокомплекс
              &quot;Прохлада&quot;, които са в непосредствена близост и до
              прочутия и красив Каменишки водопад. Храмовият празник на Камена е
              2 май - Борисовден по името на черквата в селото. Празникът на
              селото е 6 май – Гергьовден. Камена има автобусни връзки с гр.
              Петрич и съседните подгорски села на всеки час.
            </Typography>
          </Stack>
        </Stack>
      </Stack>
    </Stack>
  );
};

export default page;
