"use client";
import PageHeader from "@/components/SmallComponents/PageHeader";
import { Stack, Typography } from "@mui/material";
import Image from "next/image";
import image2 from "../../../../public/assets/tourism/sintica.jpg";
import image3 from "../../../../public/assets/tourism/samuil.jpg";
import image4 from "../../../../public/assets/tourism/houseVanga.jpg";

const page = () => {
  return (
    <Stack>
      <PageHeader
        title="Културно-исторически туризъм"
        image="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%B7%D0%B0%D1%80%D0%BE%D0%B4%D0%B8%D0%BD%D0%B0%D1%82%D0%B0_riM7gUYCm.jpg?updatedAt=1709645720133"
      />

      <Stack>
        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
          p={{ xs: 2, sm: 2, md: 10 }}
        >
          <Image
            src={image2}
            alt="Heraclea Sintica"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "450px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack width="100%" maxWidth="700px" gap={2}>
            <Typography component="h4" variant="h3">
              Античен град Хераклея Синтика
            </Typography>

            <Typography component="p" variant="body1">
              Повече от век учените спорят къде точно е тайнствения град, за
              който още Омир пише – града на хераклейците…Случайно заловен
              надпис през 2002г. разкрива неподозирана тайна – античния град
              Хераклея Синтика стои застинал край Рупите. Траки, македони, елини
              и римляни са оставили своя отпечатък върху значимата и драматична
              история на античен полис.
            </Typography>
            <Typography component="p" variant="body1">
              Основан в средата на IVв.пр.Хр., градът е просъществувал близо
              десет века.Разрушен от две последователни мощни земетресения в
              края на IVв. и началото на Vв.През своето съществуване Хераклея
              Синтика е имал съществена роля в римската провинция Македония.
            </Typography>
            <Typography component="p" variant="body1">
              Археологическите проучвания продължават и в момента и нови и
              неподозирани открития излизат пред очите на посетителите. Системни
              археологически проучвания се провеждат от 2007г., а очакванията на
              учените са, че най-интересното тепърва предстои…
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
          p={{ xs: 2, sm: 2, md: 10 }}
        >
          <Image
            src={image3}
            alt="Samuil Fortress"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "450px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack width="100%" maxWidth="700px" gap={2}>
            <Typography component="h4" variant="h3">
              Самуилова Крепост
            </Typography>

            <Typography component="p" variant="body1">
              Самуилова крепост е исторически обект, издигнал се в X век в
              близост до Петрич, във важен период от българската история.
              Построена по време на управлението на българския цар Самуил,
              крепостта е била не само стратегическо укрепено място, но и символ
              на силата и величието на българското владичество. Крепостта е
              осигурявала изключителни възможности за наблюдение и защита, което
              я прави ключова точка в средновековната българска история.
            </Typography>
            <Typography component="p" variant="body1">
              Стените и кулите на Самуилова крепост, запазени до днес, са
              впечатляващ пример за средновековна военна архитектура.
              Посетителите могат да се насладят на прекрасни гледки към
              околностите и да разгледат археологически открития, свързани с
              живота и историята на крепостта. Тя е не само атракция за туристи,
              но и важен източник на знание за българското наследство и култура.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
          p={{ xs: 2, sm: 2, md: 10 }}
        >
          <Image
            src={image4}
            alt="Hose of Vanga"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "450px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack width="100%" maxWidth="700px" gap={2}>
            <Typography component="h4" variant="h3">
              Къща Ванга
            </Typography>

            <Typography component="p" variant="body1">
              Къщата на Ванга представлява историческа забележителност в град
              Петрич, която е домът на известната българска ясновидка и
              целителка Ванга. Тя е привлекла вниманието на хиляди хора от цял
              свят, които се интересуват от мистериите на човешкия ум и
              възможностите за предвиждане на бъдещи събития.
            </Typography>

            <Typography component="p" variant="body1">
              Къщата представлява типичен български дом от 19-ти век и е
              превърната в музей, където посетителите могат да видят предмети и
              артефакти от живота и дейността на Ванга. В музея се съхраняват
              различни предмети, свързани с нейната работа като книги, снимки и
              лични вещи.
            </Typography>

            <Typography component="p" variant="body1">
              Посещението на Къщата на Ванга е възможност да се запознаете
              по-добре с историята и легендите, свързани с тази изключителна
              личност, както и да разгадаете тайните на нейните предсказания и
              уникални способности.
            </Typography>
          </Stack>
        </Stack>
      </Stack>

      <Stack width="100%" maxWidth="1600px" m="0 auto" gap={8} py={10} px={4}>
        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%B7%D0%B0%D1%80%D0%BE%D0%B4%D0%B8%D0%BD%D0%B0%D1%82%D0%B0_riM7gUYCm.jpg?updatedAt=1709645720133"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "500px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Военен паметник “Загинали за Родината”
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Паметникът в гр. Петрич се намира в централната част на площад
              „Македония” в паркова среда. Петричкото гражданство построява с
              доброволно събрани средства този монумент, за да увековечи за
              вечни времена и във видимо реален израз признателността си към
              загиналите свои съграждани в Балканската, Междусъюзническата и
              Първата световна война, а също така и по време на гръцкото
              нашествие в Петрички окръг през 1925 година.
            </Typography>
            <Typography component="p" variant="body1" textAlign="justify">
              Идеята за издигане на паметник се ражда между офицерите и
              подофицерите от петрички гарнизон, от организациите на запасните
              офицери и подофицери от македоно-одринското опълчение и Съюза на
              пострадалите от войните. Решението за издигане на паметника е
              взето на 9 януари 1934 г. на общоградско събрание в салона на
              читалище „Братя Миладинови”. Още по време на събранието започва
              набирателната сметка за събиране на средства. Жителите на Петрич
              успяват да съберат необходимите средства и паметникът е изграден.
              На 31 октомври 1937 г., по повод 25-ата годишнина от
              освобождението на Петрич от турско робство паметникът е открит
              тържествено. Той се състои от две части: четириъгълен гранитен
              постамент и скулптурна композиция от двама войника, също изпълнени
              от гранит. Върху четирите страни на пиедестала са оформени
              мемориални плочи с вдълбани текстове, инкрустирали с бронз. На
              северната лицева страна върху мраморната плоча е положен
              металически кръст за храброст с текст „Загинали за родината
              1912-1913 и 1915-1918 г.” На останалите три плочи по азбучен са
              изписани имената, датите и мястото на загиналите петричани в трите
              войни и в сражението срещу гърците през 1925 г. Много от тях са
              убити при Криволак, Щип, Завоя на Черна, Кюстендил, Кукуш, Солун,
              Покровник, Демир Хисар, Струмица, Петрич и други места, където се
              е движила фронтовата линия. Върху гранитния постамент са стъпили
              скулптурните фигури на двама български воини , облечени в шинели и
              в пълно бойно снаряжение. Едната фигура представлява изправен
              войник с пушка в ръка и изразява бойния вик „Напред на нож”.
              Втората фигура е приклекнал войник с пистолет в ръката и силно
              притиснал до гърдите си българското знаме. Лицата и на двамата са
              устремени, изразяващи готовност за саможертва. Паметникът има
              определен идеен замисъл. Каменната основа наподобява гробница,
              сякаш събрала в едно костите на загиналите, пръснати по различните
              бойни полета. Скулптурните фигури символизират готовност на
              българските воини да защитават род и Родина.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%A9%D0%B0%D0%B1%D0%BE_UnAwK6Pxk.jpg?updatedAt=1709645720143"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "1000px",
              height: "670px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Военен паметник в местност ”Щабо”
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Монументът изграден в местността Щабо от Министерство на отбраната
              и Община Петрич е в памет на войниците от 11 –та пехотна
              Македонска дивизия. Паметника е изграден по предложение на
              Инициативен комитет от с. Габрене под вр. Тумба на 1 800 м
              надморска височина. По техни сведения българска войскова част,
              разположена в района на връх Тумба, издига през 1916 г. паметник в
              местността Щабо, който през 1926 година е разрушен от гръцки
              войски. 11-та пехотна Македонска дивизия е била под командването
              на генерал Кръстю Златарев. През 1918 година две бригади на
              дивизията са придадени на Втора армия, а една заема част от
              Дойранската позиция (защитавана от ген. Вл. Вазов) до връх Висока
              чука в Беласица и участва в епичните Дойрански сражения през
              есента на 1918 година, в които Първа българска армия отблъсква
              англо-гръцкото настъпление. В м. Щабо има редица други материални
              следи, сред които и каменен надпис в близост до т.нар. Фердинандов
              път.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/5a159f95590360d0c5ad93491d27c7b7_ZK4DGTTK7.jpg?updatedAt=1709646146039"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "750px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Военен паметник “Дрангова Чешма”
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Военен паметник „Дрангова чешма“ е издигната по инициатива и по
              нареждане на полковник Борис Дрангов.Той е командир на 5-ти
              Македонски полк по време на Първата световна война. През 1916г.
              полкът е разположен в района на днешното село Дрангово, което е на
              6 км. от Петрич. Дранговата чешма е издигната в памет на
              загиналите от полка и е осветена под ръководството на полковник
              Дрангов на 16.04.1916 година. На лицевата страна на чешмата има
              надпис “1916 – на падналите юнаци от 5-ти пехотен македонски
              полк“. Намира се в началото на село Дрангово (посока от гр.Петрич
              ), край пътя за ГКПП Кулата.
            </Typography>
          </Stack>
        </Stack>
      </Stack>
    </Stack>
  );
};

export default page;
