"use client";
import PageHeader from "@/components/SmallComponents/PageHeader";
import { Stack, Typography } from "@mui/material";
import Image from "next/image";

const page = () => {
  return (
    <Stack>
      <PageHeader
        title="Паметници"
        image="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%B7%D0%B0%D1%80%D0%BE%D0%B4%D0%B8%D0%BD%D0%B0%D1%82%D0%B0_riM7gUYCm.jpg?updatedAt=1709645720133"
      />

      <Stack width="100%" maxWidth="1600px" m="0 auto" gap={8} py={10} px={4}>
        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%B7%D0%B0%D1%80%D0%BE%D0%B4%D0%B8%D0%BD%D0%B0%D1%82%D0%B0_riM7gUYCm.jpg?updatedAt=1709645720133"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "500px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Военен паметник “Загинали за Родината”
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Паметникът в гр. Петрич се намира в централната част на площад
              „Македония” в паркова среда. Петричкото гражданство построява с
              доброволно събрани средства този монумент, за да увековечи за
              вечни времена и във видимо реален израз признателността си към
              загиналите свои съграждани в Балканската, Междусъюзническата и
              Първата световна война, а също така и по време на гръцкото
              нашествие в Петрички окръг през 1925 година.
            </Typography>
            <Typography component="p" variant="body1" textAlign="justify">
              Идеята за издигане на паметник се ражда между офицерите и
              подофицерите от петрички гарнизон, от организациите на запасните
              офицери и подофицери от македоно-одринското опълчение и Съюза на
              пострадалите от войните. Решението за издигане на паметника е
              взето на 9 януари 1934 г. на общоградско събрание в салона на
              читалище „Братя Миладинови”. Още по време на събранието започва
              набирателната сметка за събиране на средства. Жителите на Петрич
              успяват да съберат необходимите средства и паметникът е изграден.
              На 31 октомври 1937 г., по повод 25-ата годишнина от
              освобождението на Петрич от турско робство паметникът е открит
              тържествено. Той се състои от две части: четириъгълен гранитен
              постамент и скулптурна композиция от двама войника, също изпълнени
              от гранит. Върху четирите страни на пиедестала са оформени
              мемориални плочи с вдълбани текстове, инкрустирали с бронз. На
              северната лицева страна върху мраморната плоча е положен
              металически кръст за храброст с текст „Загинали за родината
              1912-1913 и 1915-1918 г.” На останалите три плочи по азбучен са
              изписани имената, датите и мястото на загиналите петричани в трите
              войни и в сражението срещу гърците през 1925 г. Много от тях са
              убити при Криволак, Щип, Завоя на Черна, Кюстендил, Кукуш, Солун,
              Покровник, Демир Хисар, Струмица, Петрич и други места, където се
              е движила фронтовата линия. Върху гранитния постамент са стъпили
              скулптурните фигури на двама български воини , облечени в шинели и
              в пълно бойно снаряжение. Едната фигура представлява изправен
              войник с пушка в ръка и изразява бойния вик „Напред на нож”.
              Втората фигура е приклекнал войник с пистолет в ръката и силно
              притиснал до гърдите си българското знаме. Лицата и на двамата са
              устремени, изразяващи готовност за саможертва. Паметникът има
              определен идеен замисъл. Каменната основа наподобява гробница,
              сякаш събрала в едно костите на загиналите, пръснати по различните
              бойни полета. Скулптурните фигури символизират готовност на
              българските воини да защитават род и Родина.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%A9%D0%B0%D0%B1%D0%BE_UnAwK6Pxk.jpg?updatedAt=1709645720143"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "1000px",
              height: "670px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Военен паметник в местност ”Щабо”
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Монументът изграден в местността Щабо от Министерство на отбраната
              и Община Петрич е в памет на войниците от 11 –та пехотна
              Македонска дивизия. Паметника е изграден по предложение на
              Инициативен комитет от с. Габрене под вр. Тумба на 1 800 м
              надморска височина. По техни сведения българска войскова част,
              разположена в района на връх Тумба, издига през 1916 г. паметник в
              местността Щабо, който през 1926 година е разрушен от гръцки
              войски. 11-та пехотна Македонска дивизия е била под командването
              на генерал Кръстю Златарев. През 1918 година две бригади на
              дивизията са придадени на Втора армия, а една заема част от
              Дойранската позиция (защитавана от ген. Вл. Вазов) до връх Висока
              чука в Беласица и участва в епичните Дойрански сражения през
              есента на 1918 година, в които Първа българска армия отблъсква
              англо-гръцкото настъпление. В м. Щабо има редица други материални
              следи, сред които и каменен надпис в близост до т.нар. Фердинандов
              път.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/5a159f95590360d0c5ad93491d27c7b7_ZK4DGTTK7.jpg?updatedAt=1709646146039"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "750px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Военен паметник “Дрангова Чешма”
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Военен паметник „Дрангова чешма“ е издигната по инициатива и по
              нареждане на полковник Борис Дрангов.Той е командир на 5-ти
              Македонски полк по време на Първата световна война. През 1916г.
              полкът е разположен в района на днешното село Дрангово, което е на
              6 км. от Петрич. Дранговата чешма е издигната в памет на
              загиналите от полка и е осветена под ръководството на полковник
              Дрангов на 16.04.1916 година. На лицевата страна на чешмата има
              надпис “1916 – на падналите юнаци от 5-ти пехотен македонски
              полк“. Намира се в началото на село Дрангово (посока от гр.Петрич
              ), край пътя за ГКПП Кулата.
            </Typography>
          </Stack>
        </Stack>
      </Stack>
    </Stack>
  );
};

export default page;
