"use client";
import PageHeader from "@/components/SmallComponents/PageHeader";
import { Stack, Typography } from "@mui/material";
import Image from "next/image";

const page = () => {
  return (
    <Stack>
      <PageHeader
        title="Поклоннически туризъм"
        image="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%A1%D0%B2%D0%B5%D1%82%D0%B8%20%D0%9F%D0%B0%D0%BD%D1%82%D0%B5%D0%BB%D0%B5%D0%B9%D0%BC%D0%BE%D0%BD_8ML8Qvs2Xn.jpg?updatedAt=1709649405139"
      />

      <Stack width="100%" maxWidth="1600px" m="0 auto" gap={8} py={10} px={4}>
        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%A1%D0%B2%D0%B5%D1%82%D0%B8%20%D0%9F%D0%B0%D0%BD%D1%82%D0%B5%D0%BB%D0%B5%D0%B9%D0%BC%D0%BE%D0%BD_8ML8Qvs2Xn.jpg?updatedAt=1709649405139"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "700px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Скален храм “Свети Панталеймон”
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              „Свети Пантелеймон“ е единствената скална църква в Община Петрич,
              част от Неврокопската епархия на Българската православна църква.
              Намира се близо до село Генерал Тодоров. Самата скална църква се
              намира на източния склон на кратера на угасналият вулкан Кожух. За
              да достигнете до това съкрално място може да мините по пътека,
              започваща от ЖП гарата на село Генерал Тодоров или по сравнително
              хубав полски път започващ от черквата Св. Атанасий над селото.
              Постепенно пътят проходим и за автомобили се стеснява и става
              живописна пътека от, която се открива невероятна гледка към
              околността. Църквата е издълбана в скала над река Струма. На
              олтарната ниша има античен релеф на Асклепий, даващ основание на
              археолозите да смятат, че на мястото е имало антично светилище на
              Асклепий. Няколко оцелели скални килии свидетелстват, че през
              средновековието на това място е съществувало значително монашеско
              братство. За една от тях има предание, че е подслонила Свети Иван
              Рилски преди заселването му в Рила. Всяка година на 27 юли вярващи
              християни от цяла Югозападна България се събират край църквата за
              нейния храмов празник.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%A3%D1%81%D0%BF%D0%B5%D0%BD%D0%B8%D0%B5%20%D0%91%D0%BE%D0%B3%D0%BE%D1%80%D0%BE%D0%B4%D0%B8%D1%87%D0%BD%D0%BE__1YAAMCf9c.jpg?updatedAt=1709649725696"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Успение Богородично“
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Църквата „Успение Богородично“ или „Света Богородица“ е
              възрожденска църква в Петрич, част от Неврокопската епархия на
              Българската православна църква. Църквата е построена в 1857 година
              с труда и средствата на цялото християнско население от града.
              Ктитори на храма са Филчо Чавеев, Анго Василиев, Димитър Великов,
              Стоян Папазов, Георги Урумов и други. В църквата се служи на
              гръцки, а в двора е отворено гръцко училище. Знаменита е годината
              1881 г., когато в църквата започва да се проповядва едновременно
              на български и гръцки език. В архитектурно отношения църквата е
              псевдобазилика, с полуцилиндрична апсида, женско отделение и
              притвор. През 1922 година притворът е преустроен и над него е
              изградена 16 метрова камбанария. Храмът представлява масивна
              каменна сграда с външни размери – 24 метра дължина и 17.5 метра
              ширина с дебелина на зидовете 1 метър. Дърворезбен иконостас,
              иконите и стенописите са дело на дебърските зографи – братята
              Христо, Исакий и Кузман Макариеви. Най-старият запазен храм в
              Петрич е почти унищожен от опустошителния пожар, възникнал през
              злополучната нощ на 17.11.1987 г. Огнената стихия изгаря
              великолепния иконостас с всичките му икони, стенописите в наоса и
              покрива. Невредими остават само стенописите отвън в притвора.
              Впоследствие храмът е основно обновен и днес с целия си блясък
              отново приема поклоници.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%A1%D0%B2%D0%B5%D1%82%D0%B8%20%D0%9D%D0%B8%D0%BA%D0%BE%D0%BB%D0%B0%D0%B9_C_trDDUmg.jpg?updatedAt=1709649405031"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              “Свети Николай”
            </Typography>
            <Typography component="p" variant="body1" textAlign="justify">
              „Свети Николай“ или „Свети Никола“ е възрожденска църква в
              българския Петрич, част от Неврокопската епархия на Българската
              православна църква. Църквата е построена в 1868 година в годината,
              когато се основава първата Българска църковна община.
              Строителството се осъществява предимно със средствата и труда на
              българското население от града. В архитектурно отношение сградата
              представлява трикорабна едноабсидна псевдобазилика с обширно
              женско отделение в западната част на наоса. През 1924 година от
              запад е добавен притвор, дървена камбанария и е разширено женското
              отделение. През 1940 година е пристроена нова масивна камбанария.
              В северозападния край на църковния двор е имало параклис-костница
              „Света Петка“ и квартално гробище. През 1960 година от притворът
              са обособени кръщелна и параклис „Света Петка“ – разположен
              първоначално от ляво, а сега вдясно. В църквата е работил местният
              иконописец Иван Константинов, чието име може да се прочете върху
              иконата „Св.св. Кирил и Методий“ (1883). Една от иконите е дело на
              Андон Зограф (1898). На 21 септември 1995 година църквата
              пострадва от пожар, след който е основно ремонтирана.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%A5%D1%80%D0%B0%D0%BC%D1%8A%D1%82%20_%D0%A1%D0%B2.%20%D0%93%D0%B5%D0%BE%D1%80%D0%B3%D0%B8__Pgy7NnS50.jpg?updatedAt=1709649402894"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              “Свети Георги”
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Храмът „Св. Георги” се намира в източния край на квартал
              „Дълбошница”. Изграден е през 1920 – 1921 г. в близост до
              съществуващ некропол от българи – бежанци от Егейска Македония.
              Камъните за градежа му са взимани от намиралите се около 1 км. в
              източна посока руини от манастира „Св. Спас”, разрушен през XIX в.
              Църквата е в днешния си вид от 1967 г., когато е изцяло изградена
              върху основите на по-стария храм. В новия храм са пренесени царски
              двери и Светите мощи не Йаков Костурски. Днес до църквата „Св.
              Георги” има нова просторна сграда, в която се помещава неделно
              училище.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/_%D0%A1%D0%B2%D0%B5%D1%82%D0%B8%20%D0%98%D0%BB%D0%B8%D1%8F__a3zyuFsNo.jpg?updatedAt=1709649402887"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              “Свети Илия”
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              „Свети Илия“ е православен храм разположен в южния край на
              махалата Виздол, в склоновете на Беласица, южно над Петрич.
              Построен е в 1923 година в подножието на средновековната крепост
              Гяур калеси. При ремонтни дейности около храма е открита монетна
              находка от 200 медни монети на византийски императори от XII век.
              Това дава основание да се предполага, че на мястото на църквата
              или близо до нея е имало средновековен храм. Църквата представлява
              малка трикорабна, едноапсидна псевдобазилика без купол, притвор и
              камбанария. Вътрешното пространство е разделено на три кораба от
              два реда от по три колони, които поддържат дървената покривна
              конструкция. Таваните над страничните кораби са равни, а средният
              е засводен.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D1%81%D0%B2.%D0%BF%D0%B5%D1%82%D0%BA%D0%B0_D6Pc6G7me.jpg?updatedAt=1709649655612"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Манастир “Света Петка”
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Петричкият манастир „Св. Петка” е разположен в северното подножие
              на планина Беласица, а и в западните покрайнини на Петрич.
              Началото на днес известния Петрички манастир е поставено през 1912
              г. с построяването на черквата „Св. Петка”. В архитектурно
              отношение манастирът „Св. Петка” представлява комплекс от черква,
              жилищни и стопански постройки и параклис „Св. Мчца Неделя”.
              Манастирският храм е еднокорабна. Едноапсидна, безкуполна и с
              притвор сграда, с камбанария над входа. Всеки Четвъртък и Петък се
              отслужва вечерня (в Четвъртък) и след това св. Литургия (в Петък).
              Неделима част от манастирския ансамбъл е и вековното дърво в
              двора, което привлича вниманието на посетителите с величествената
              си снага, извисяваща се над целия комплекс.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%A5%D1%80%D0%B0%D0%BC%20_%D0%A1%D0%B2%D0%B5%D1%82%D0%B0%20%D0%9F%D0%B5%D1%82%D0%BA%D0%B0__ltXOfjohf.jpg?updatedAt=1709649402892"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Храм “Света Петка”
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              „Света Петка Българска“ е православен храм, който се намира в
              местността „Рупите“, на 3 км. от с. Рупите и на 10 км. от гр.
              Петрич Строителството на храма „Св. Петка” е наченато през 1992 г.
              под прякото ръководство на българската пророчица Ванга. Две години
              по- късно храмът е построен. Основен ктитор на храма е Ванга,
              изографисването е извършено от художника Светлин Русев,
              дърворезбите са на Григор Паунов, а кръстът над църквата е дело на
              скулптора Крум Дамянов. Около църквата е изграден цял манастирски
              комплекс, който включва 12 стаи с 30 легла, ритуална зала за
              кръщения и изложбена зала, в която са подредени снимки и вещи на
              Пророчицата. Стаите за отдих са семпли и без екстри като телефон,
              телевизор, интернет и др. В комплекса има безплатен паркинг за
              автомобили и автобуси. Безплатно е и посещението, разглеждането и
              заснемането. До храма има магазинче, в което се продават книги за
              Ванга, икони и сувенири, свързани с Храма, Рупите и Ванга. Храмът
              от 2003 г. е сред 100-те национални туристически обекти. В храма
              „Св. Петка Българска“ в Рупите свещеник изнася служба всяка
              седмица в петък, събота и неделя от 10.00 ч., а също и на всички
              официални църковни празници Работно време за посетители е всеки
              ден от 8:00-19:00 часа Телефони за връзка: 0887 667 670; 0887 667
              678
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/_%D0%A1%D0%B2%D0%B5%D1%82%D0%B8%20%D0%BF%D1%80%D0%BE%D1%80%D0%BE%D0%BA%20%D0%98%D0%BB%D0%B8%D1%8F__lAw50Sa1u.jpeg?updatedAt=1709649402904"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              “Свети пророк Илия”
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              „Свети пророк Илия“ е възрожденска църква в петричкото село
              Беласица, разположено в полупланинска местност в северното
              подножие на планината Беласица в регион Подгорие. Част от
              Неврокопската епархия на Българската православна църква. Храмът е
              паметник на културата, построен е 1897 и е най-старата църква в
              Подгорието. В архитектурно отношение представлява трикорабна
              псевдобазилика с външна галерия от запад и юг. Художествена
              стойност има интериорът на църквата, който е оформен през 1910 г.
              от зографите Теофил Минов и Мина Марков от с. Каракьой, Серско и е
              запазен напълно. Таваните са касетирани, рисувани с орнаментални
              мотиви. Стенописите по част от стените, апсидата и страничните
              ниши на източната стена са изпълнени в традицията на
              късновъзрожденската църковна живопис. Иконостастът е рисуван с
              частична резба по царските двери венчилката и кръжилата. Храмовият
              празник е на Свети Илия (20 юли). Тя е единствената църква в
              петричка община, към която има изградени пет параклиса – „Свети
              Атанас“, „Света Неделя“, „Успение Богородично“, „Света Петка“ и
              „Свети Никола“. През 2012 година художникът Александър Дончев от
              Петрич реставрира повредената от времето живописна украса на храма
              Заради името на черквата Илинден е празник на селото.
            </Typography>
          </Stack>
        </Stack>

        <Stack
          direction={{ md: "column", lg: "row" }}
          justifyContent="center"
          alignItems="flex-start"
          gap={4}
        >
          <Image
            src="https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%A7%D1%83%D1%80%D0%B8%D0%BB%D0%BE%D0%B2%D1%81%D0%BA%D0%B8%20%D0%BC%D0%B0%D0%BD%D0%B0%D1%81%D1%82%D0%B8%D1%80%20_%D0%A1%D0%B2%D0%B5%D1%82%D0%B8%20%D0%93%D0%B5%D0%BE%D1%80%D0%B3%D0%B8__gFqkY-Dv8.jpg?updatedAt=1709649403081"
            alt="Park Petrich"
            width={100}
            height={100}
            style={{
              width: "100%",
              maxWidth: "800px",
              height: "600px",
              objectFit: "cover",
              borderRadius: "10px",
            }}
          />
          <Stack gap={2}>
            <Typography component="h4" variant="h3">
              Чуриловски манастир “Свети Георги”
            </Typography>

            <Typography component="p" variant="body1" textAlign="justify">
              Чуриловският манастир „Свети Георги“ е разположен в южните
              склонове на планината Огражден в землището на село Чурилово. Той
              се намира на 28 km от Петрич и на 2 km от село Гега. Наричан е още
              Игуменски, Геговски или Манастира с дяволите. Според старо
              предание, строителството на манастира е започнало през 1848
              година. В него първоначално е разкрито обществено килийно училище,
              което по-късно е преустроено в новобългарско. Съществуват и
              предположения, че манастирът води началото си още от XIV в. А в
              днешния си вид е изграден в средата на XIX в. Съхранен е ферман за
              „разширяването и построяването“ на църквата „Свети Георги“,
              издаден на 5 март 1857 година от султан Абдул Меджид. За
              съграждането на манастира се черпят сведения и от съществуващите
              строителни надписи. В два от тях се посочва, че на 10 март 1858 г.
              е станало обновяването на църквата, а в третия – че през 1890 г. е
              построена камбанарията. Текстовете сочат, че на мястото на на
              църквата е съществувал по-стар храм.
            </Typography>
          </Stack>
        </Stack>
      </Stack>
    </Stack>
  );
};

export default page;
